## 쉘 스크립트 프로그래밍

쉘 프로그램은 리눅스 명령어를 그대로 사용하기 때문에 효율적으로 활용한다면 상대적으로 버그가 적고 빠른 강력한 프로그램을 작성할 수 있는 도구가 된다.
#### 기본 명령어(주석, 화면 지우기, 텍스트 출력 등)
* **주석**
\#으로 시작하는 경우 그 부분부터 해당 줄의 마지막 부분까지 주석처리된다.
(단, #!는 스크립트를 실행할 쉘을 지정하는 선언문을 의미)
* **화면 지우기**
clear 명령어를 이용한다.
* **화면에 텍스트 출력**
echo 명령어를 이용한다.(기본적으로 출력 후 줄바꿈하여 출력함, -n 옵션 이용시 출력 후 줄바꿈 하지 않음)
* **입력값 받기**
read 변수 의 형태로 사용한다.
* **하나의 라인에서 두 개 이상의 명령어를 실행 시**
; 로 구분하여 사용한다. Ex> date;echo date
Ex>
![](https://drive.google.com/uc?id=1m5lb5gMqns4c-Je6Zj7114g3dHX9Sqqp)
![](https://drive.google.com/uc?id=1vTxoGJCT9z0VJ16K79btxzhYlq0NboQp)

#### 변수
* 따로 자료형이 없이, 기본적으로 데이터를 string으로 저장한다.
* 영문자, _ , 숫자 로만 이루어진다.
* 데이터에 공백을 넣고자 하면 " "으로 감싸서 사용한다.
* 변수 선언을 필요로 하지 않고 바로 값을 대입하여 사용한다.
(대입할 떄는 = 을 사용, **이 때 = 양쪽에 공백이 존재하면 안된다**)
* 변수에 데이터를 대입한 다음, 변수를 사용할 때는 $ 를 붙여 사용한다.


#### 연산식
* expr 값1 연산자 값2 (**이 때 연산자 좌우로 띄어쓰기 필수**)
의 형태로 사용한다.
* 변수에 대입하거나, 화면에 출력(echo)할 때는 ``안에 expr 명령어를 넣어서 사용한다.

Ex1>`  expr 1 + 3 ` (O)   `expr 1+3 `(X)
Ex2> echo \`expr 6 + 3` 하면 9가 출력된다.


#### " ' ` 사용규칙
* " : \ , $ 문법 사용 가능
* ' : \ , \$ 문법 무시하고 그대로 \ , \$을 출력
* \` : ``안에 있는 커맨드를 실행하여 출력

Ex>
![](https://drive.google.com/uc?id=15a0xkw58m4QyB857lInjqSUIiewzSrpH)

#### 함수
* 코드를 재사용하거나 모듈화하기 위해 함수를 사용
* 함수가 호출되기 전에 정의되어야 한다.
* 리턴값은 반드시 정수형이며, 이 값은 $? 변수에 저장된다.
* 매개인자를 참조할 때는, 함수에게 넘어온 인자를 \$1, \$2와 같이 인자의 위치로 참조한다.
* 함수에 인자값을 전달할 때는 공백 한 칸씩 띄어서 인자값을 넘겨준다.

Ex> add를 함수로 만들어 호출 (add함수는  \$1, \$2를 인자로 받아 더하는 기능을 한다.)
![](https://drive.google.com/uc?id=1Aat4F8wzWlV3HL9lZqDUVJi74PZGK6Th)

* (참고) **산술 확장** 시 **$((계산식))** 의 형태를 이용한다.
````
#!/bin/bash

sum=0
first=1
i=$first

while [ $i -le 10]
do
  sum=$(($sum + $i))
  i=$(($i + 1))
done

echo "${first}에서${i}까지의 합은 ${sum}d입니다"
````

#### 명령행 인자
|  \$0  | 쉘스크립트 이름  |
|---|---|
|\$#  | 매개변수의 개수  |
| \$*  | 매개변수를 모아놓은 문자열 |
| \$1 ~ $n | 각각의 매개변수 |
| \$? | 리턴값(정수만 가능) |

#### 배열
* 쉘스크립트에서는 1차원 배열만 지원한다.
* 변수와 마찬가지로, 선언 없이 바로 대입해서 사용이 가능하다. 단 배열 변수 사용 시 반드시 \$ 뒤에 대괄호를 사용해야 한다.
 Ex> ${array[1]}
 * 배열 해제할 때는 unset 명령어를 이용한다.
 Ex> unset array[4] (전체 원소 삭제 시 unset array)
 * 배열에 값을 지정할 때는 괄호와 ""을 이용
 Ex> array=("hello" "CLUG" "world")
 * 기존의 배열의 원하는 위치에 1개의 배열 값을 추가 시
 Ex> array[6]="add"
 * 기존의 배열 전체에 바로 뒤 index로  1개의 값을 추가 시
Ex> array = (${array[@]} "addstring")

#### 연산자
&&, ||, >> 등의 논리, 산술, 비트 연산자, 비교 연산자는 다른 언어들과 동일하게 사용된다.
* 정수 비교 연산자
-eq : 같음
-ne : 같지 않음
\> 또는 -gt :  더 큼
\>\ 또는 -ge : 더 크거나 같음
\< 또는 -lt : 더 작음
\<= 또는 -le : 더 작거나 같음
(이 때, \> \< \>= \<= 은 이중 소괄호 내에서만 사용 가능  )

-------------------------------
* (참고) 리눅스 권한
: 777, 755 등의 표기로 권한을 부여하기도 한다. (777은 -rwxrwxrwx와 같은 의미)
  * 읽기(Reading) : 4    
  쓰기(Writing) : 2
  실행(Executing) : 1

Ex>  777의 권한이 부여된 경우 소유자, 그룹 사용자, 기타 사용자가 모두 4+2+1 =7, 즉 읽고 쓰고 실행하기가 가능한 경우이다.
Ex> 755의 권한이 부여된 경우 소유자는 7=4+2+1 즉 쓰기 읽기 실행이 모두 가능하고, 그 외 그룹 사용자와 기타 사용자의 경우 5=4+1로 쓰기는 불가능한 것이다.
